CREATE DATABASE  IF NOT EXISTS `traffic` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `traffic`;
-- MySQL dump 10.13  Distrib 5.7.25, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: traffic
-- ------------------------------------------------------
-- Server version	5.7.25

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `admin` (
  `id` char(18) NOT NULL,
  `name` varchar(20) NOT NULL,
  `password` char(32) NOT NULL,
  `sex` varchar(10) DEFAULT NULL,
  `location` varchar(100) DEFAULT NULL,
  `telephone` char(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` VALUES ('150423199910274415','陈玉龙','E10ADC3949BA59ABBE56E057F20F883E','2','','');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `answerrecord`
--

DROP TABLE IF EXISTS `answerrecord`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `answerrecord` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` char(18) NOT NULL COMMENT '答题用户id',
  `tid` int(11) NOT NULL COMMENT '答题id',
  `right` tinyint(4) DEFAULT NULL COMMENT '是否正确',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=290 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `answerrecord`
--

LOCK TABLES `answerrecord` WRITE;
/*!40000 ALTER TABLE `answerrecord` DISABLE KEYS */;
INSERT INTO `answerrecord` VALUES (48,'150423199910274415',63,0),(63,'150423199910274415',56,0),(76,'150423199910274415',52,0),(85,'150423199910274415',16,0),(91,'150423199910274415',14,0),(104,'150423199910274415',27,0),(111,'150423199910274415',59,0),(112,'150423199910274415',19,1),(120,'150423199910274415',24,0),(125,'150423199910274415',34,0),(126,'150423199910274415',18,1),(132,'150423199910274415',43,0),(141,'150423199910274415',50,0),(142,'150423199910274415',38,1),(144,'150423199910274415',45,1),(147,'150423199910274415',11,1),(150,'150423199910274415',44,0),(151,'150423199910274415',28,0),(152,'150423199910274415',33,0),(155,'150423199910274415',32,1),(156,'150423199910274415',42,1),(160,'150423199910274415',60,0),(162,'150423199910274415',46,0),(163,'150423199910274415',62,0),(164,'150423199910274415',65,0),(165,'150423199910274415',61,0),(166,'150423199910274415',57,0),(167,'150423199910274415',17,0),(169,'150423199910274415',35,0),(171,'150423199910274415',26,1),(172,'150423199910274415',9,0),(173,'150423199910274415',31,0),(175,'150423199910274415',15,1),(176,'150423199910274415',30,0),(177,'150423199910274415',20,0),(178,'150423199910274415',41,1),(179,'150423199910274415',13,1),(180,'150423199910274415',29,0),(182,'150423199910274415',36,0),(183,'150423199910274415',55,0),(184,'150423199910274415',4,0),(185,'150423199910274415',5,1),(186,'150423199910274415',39,0),(188,'150423199910274415',25,0),(189,'150423199910274415',53,0),(190,'150423199910274415',23,1),(192,'150423199910274415',49,1),(194,'150423199910274415',22,0),(195,'150423199910274415',10,0),(196,'150423199910274415',64,1),(197,'150423199910274415',54,0),(198,'150423199910274415',7,0),(200,'150423199910274415',40,0),(201,'150423199910274415',37,1),(202,'150423199910274415',48,1),(203,'150423199910274410',1,1),(204,'150423199910274410',2,0),(206,'150423199910274410',5,1),(207,'150423199910274410',21,0),(208,'150423199910274410',4,0),(209,'150423199910274410',69,0),(210,'150423199910274410',68,1),(211,'150423199910274410',67,1),(212,'150423199910274410',19,0),(213,'150423199910274410',37,0),(215,'150423199910274419',2,1),(217,'150423199910274419',68,0),(218,'150423199910274419',67,0),(219,'150423199910274419',4,0),(221,'150423199910274419',59,0),(222,'150423199910274419',62,0),(223,'150423199910274419',37,0),(224,'150423199910274419',3,0),(225,'150423199910274419',33,0),(226,'150423199910274419',17,1),(227,'150423199910274419',18,0),(228,'150423199910274419',28,0),(229,'150423199910274419',21,0),(230,'150423199910274419',54,0),(231,'150423199910274419',53,0),(232,'150423199910274419',1,1),(233,'150423199910274419',36,0),(234,'150423199910274419',38,1),(235,'150423199910274419',24,1),(236,'150423199910274419',35,0),(237,'150423199910274419',60,0),(238,'150423199910274419',19,0),(240,'150423199910274415',2,0),(241,'150423199910274415',3,1),(242,'150423199910274415',51,0),(243,'150423199910274415',71,0),(244,'150423199910274415',21,1),(245,'150423199910274415',8,0),(246,'150423199910274415',66,0),(249,'150423199903150019',34,0),(250,'150423199903150019',26,0),(252,'150423199903150019',36,0),(257,'150423199903150019',46,0),(262,'150423199903150019',68,0),(265,'150423199903150019',66,0),(267,'150423199903150019',1,1),(268,'150423199903150019',2,1),(269,'150423199903150019',3,1),(272,'150423199903150019',69,0),(273,'150423199903150019',67,0),(274,'150423199903150019',43,0),(275,'150423199903150019',16,0),(276,'150423199903150019',39,0),(277,'150423199903150019',17,0),(278,'150423199903150019',53,0),(279,'150423199903150019',18,0),(280,'150423199903150019',37,1),(281,'150423199903150019',4,0),(282,'150423199903150019',32,0),(283,'150423199903150019',9,0),(284,'150423199903150019',25,0),(285,'150423199903150019',33,0),(286,'150423199903150019',45,1),(287,'150423199903150019',27,0),(288,'150423199903150019',41,1),(289,'150423199910274415',1,1);
/*!40000 ALTER TABLE `answerrecord` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `class`
--

DROP TABLE IF EXISTS `class`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `class1` varchar(45) NOT NULL COMMENT '科目',
  `class2` varchar(45) NOT NULL COMMENT '分类',
  `class3` varchar(45) NOT NULL COMMENT '车型',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class`
--

LOCK TABLES `class` WRITE;
/*!40000 ALTER TABLE `class` DISABLE KEYS */;
INSERT INTO `class` VALUES (1,'科目四','出现爆胎、转向失控、制动失灵等紧急情况时临危处置知识','小车'),(2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车'),(3,'科目四','安全行车、文明驾驶知识','小车'),(4,'科目四','道路交通安全法律、法规和规章','小车'),(5,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车'),(6,'科目四','机动车总体构造和主要安全装置常识，日常检查和维护基本知识','小车'),(7,'科目四','交通信号及其含义','小车'),(8,'科目一','道路交通安全法律、法规和规章','小车'),(9,'科目一','交通信号及其含义','小车'),(10,'科目一','安全行车、文明驾驶知识','小车'),(11,'科目一','机动车驾驶操作相关基础知识','小车');
/*!40000 ALTER TABLE `class` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `collection`
--

DROP TABLE IF EXISTS `collection`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `collection` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` char(18) NOT NULL COMMENT '用户id',
  `tid` int(11) NOT NULL COMMENT '收藏题目id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=38 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `collection`
--

LOCK TABLES `collection` WRITE;
/*!40000 ALTER TABLE `collection` DISABLE KEYS */;
INSERT INTO `collection` VALUES (24,'150423199910274415',1),(25,'150423199910274415',2),(26,'150423199910274415',67),(27,'150423199910274410',21),(28,'150423199910274410',4),(29,'150423199910274419',3),(30,'150423199910274419',4),(31,'150423199910274419',19),(32,'150423199910274415',3),(33,'150423199903150019',2),(34,'150423199903150019',52),(35,'150423199903150019',4),(36,'150423199903150019',9),(37,'150423199903150019',69);
/*!40000 ALTER TABLE `collection` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `testrecord`
--

DROP TABLE IF EXISTS `testrecord`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `testrecord` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` char(18) NOT NULL,
  `class1` varchar(10) NOT NULL COMMENT '科目',
  `class3` varchar(10) NOT NULL COMMENT '车型',
  `score` int(11) NOT NULL COMMENT '分数',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `testrecord`
--

LOCK TABLES `testrecord` WRITE;
/*!40000 ALTER TABLE `testrecord` DISABLE KEYS */;
INSERT INTO `testrecord` VALUES (1,'150423199910274415','科目四','小车',4),(2,'150423199910274415','科目四','小车',0),(3,'150423199910274415','科目四','小车',0),(4,'150423199910274415','科目四','小车',0),(5,'150423199910274415','科目四','小车',0),(6,'150423199910274415','科目四','小车',0),(7,'150423199910274415','科目四','小车',0),(8,'150423199910274415','科目四','小车',0),(9,'150423199910274415','科目四','小车',0),(10,'150423199910274410','科目四','小车',0),(11,'150423199910274419','科目四','小车',8),(12,'150423199903150019','科目四','小车',2),(13,'150423199903150019','科目四','小车',6);
/*!40000 ALTER TABLE `testrecord` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `title`
--

DROP TABLE IF EXISTS `title`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `title` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '题目编号',
  `content` varchar(500) NOT NULL COMMENT '题目内容',
  `key1` varchar(200) NOT NULL COMMENT '选项1',
  `key2` varchar(200) NOT NULL COMMENT '选项2',
  `key3` varchar(200) DEFAULT NULL COMMENT '选项3',
  `key4` varchar(200) DEFAULT NULL COMMENT '选项四',
  `key` varchar(5) NOT NULL COMMENT '正确答案',
  `multiple` tinyint(1) NOT NULL COMMENT '是否多选',
  `picture` varchar(100) DEFAULT NULL COMMENT '图片',
  `score` int(11) NOT NULL COMMENT '分值',
  `class1` varchar(50) NOT NULL COMMENT '分类1',
  `class2` varchar(45) NOT NULL COMMENT '分类2',
  `class3` varchar(20) NOT NULL,
  `analysis` varchar(200) DEFAULT '此题无解析' COMMENT '题目解析',
  `admin` char(18) NOT NULL COMMENT '出题管理员',
  `rightcount` int(11) NOT NULL,
  `wrongcount` int(11) NOT NULL,
  `rate` float NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=72 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `title`
--

LOCK TABLES `title` WRITE;
/*!40000 ALTER TABLE `title` DISABLE KEYS */;
INSERT INTO `title` VALUES (1,'机动车在高速行驶时，前面扬起的飞石或是遗撒物将挡风玻璃击裂，造成视线模糊不清的状况下，驾驶人要逐渐降低车速、开启危险报警闪光灯并将机动车移至不妨碍交通的地点。','正确','错误','','','A',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','','150423199910274415',11,5,0.3125),(2,'机动车涉水后，驾驶人要间断轻踩制动踏板，以恢复制动效能。','正确','错误','','','A',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','150423199910274415',5,4,0.444444),(3,'驾驶机动车通过积水路段时，应注意两侧的行人和非机动车，降低车速，防止路面积水飞溅。','正确','错误','','','A',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','150423199910274415',4,4,0.5),(4,'雪天行车，车轮的附着力大大减小，跟车距离不是主要的，只需要保持低速行驶便可以防止事故发生。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','150423199910274415',0,12,1),(5,'下坡路制动失效后，在不得已的情况下，可用车身侧面擦撞山坡，迫使机动车减速停车。','正确','错误','','','A',0,NULL,2,'科目四','出现爆胎、转向失控、制动失灵等紧急情况时临危处置知识','小车','此题无详解','150423199910274415',3,0,0),(6,'前方遇有大型拉土(石)货车，应当尽量远离，避让。','正确','错误','','','A',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','150423199910274415',0,0,0),(7,'大雾天气能见度低，开启远光灯会提高能见度。','正确','错误','','','B',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','150423199910274415',0,1,1),(8,'高速路上，机动车因故障暂时不能离开应急车道或路肩时，驾乘人员要下车在路边等候，但不得离开高速公路。','正确','错误','','','B',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','150423199910274415',0,2,1),(9,'变更车道前确认后方无来车时可以不开转向灯变道。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','150423199910274415',1,2,0.666667),(10,'机动车在什么样的路面上制动时车轮最容易抱死?','混净土路','土路','冰雪路面','沙土路','C',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','150423199910274415',0,4,1),(11,'超车时，如果无法保证与被超车辆的安全间距，应主动放弃超车。','正确','错误','','','A',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','150423199910274415',3,2,0.4),(13,'驾驶人在一个记分周期内累积记分达到12分的，交通警察依法扣留驾驶证。','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','150423199910274415',1,0,0),(14,'驾驶机动车行驶过程中，驾驶人要随时注意与前车的安全距离，安全距离应随着车速的提高而增加。','正确','错误','','','A',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',1,1,0.5),(15,'驾驶机动车驶入高速公路收费口时，没有安装ETC卡的车辆，不能驶入ETC车道。','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,1,0.5),(16,'机动车停车的错误做法是什么？','应当在规定地点停放','禁止在人行道上停放','在道路上临时停车时，不得妨碍其他机动车和行人通行','可以停放在非机动车道上','D',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',0,4,1),(17,'在高速公路行车选择什么地方停车？','服务区','加速车道','减速车道','匝道','A',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',2,3,0.6),(18,'在高速公路上遇到紧急情况避险时需注意什么？','采取制动措施减速','向左侧转向避让','迅速转动转向盘躲避','向右侧转向避让','A',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',1,2,0.666667),(19,'车辆在主干道上行驶，驶近主支干道交汇处时，为防止与从支路突然驶入的车辆相撞，应怎样做？','提前减速、观察，谨慎驾驶','保持正常速度行驶','鸣喇叭，迅速通过','提前加速通过','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',2,2,0.5),(20,'下列属于危险易燃固体的是什么？','火柴','火药','电石','炸药','A',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',2,3,0.6),(21,'驾驶的车辆正在被其他车辆超越时，若此时后方有跟随行驶的车辆，应怎样做？','继续加速行驶','稍向右侧行驶，保证横向安全距离','靠道路中心行驶','加速向右侧让路','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',2,6,0.75),(22,'夜间驾驶机动车在没有中心隔离设施或者没有中心线的道路上行驶，以下哪种情况下应当改用近光灯？','接近没有交通信号灯控制的交叉路口时','与对向机动车会车时','接近人行横道时','城市道路照明条件不良时','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,2,0.666667),(23,'上道路行驶的机动车故意遮挡、污损、不按规定安装机动车号牌的一次记几分？','12分','6分','3分','2分','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,0,0),(24,'驾驶机动车发生以下交通事故，哪种情况适用自行协商解决？','对方饮酒的','对事实及成因有争议的','未造成人身伤亡，对事实及成因无争议的','造成人身伤亡的','C',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,2,0.666667),(25,'车辆在山区道路跟车行驶时，应怎样做？','紧随前车之后','适当加大安全距离','适当减小安全距离','尽可能寻找超车机会','B',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',1,3,0.75),(26,'遇后车发出超车信号后，只要具备让超条件应怎样做？','迅速减速或紧急制动','让出适当空间加速行驶','主动减速并靠右侧行驶','靠道路右侧加速行驶','C',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,2,0.666667),(27,'驾驶人违反交通运输管理法规发生重大事故使公私财产遭受重大损失，可能会受到什么刑罚？','处5年以上徒刑','处3年以下徒刑或者拘役','处3年以上徒刑','处3年以上7年以下徒刑','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,2,1),(28,'驾驶人行车中看到注意儿童标志的时候，应怎样做？','加速行驶','绕道行驶','谨慎选择行车速度','保持正常车速行驶','C',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,2,1),(29,'驾驶机动车在下列哪种情形下不能超越前车？','前车减速让行','前车正在左转弯','前车靠边停车','前车正在右转弯','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,5,0.833333),(30,'人行横道上禁止掉头的原因是什么？','人行横道禁止车辆通行','避免妨碍行人正常通行，确保行人安全','人行横道禁止停车','路段有监控设备','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',3,2,0.4),(31,'对驾驶过程中接打手机的看法正确的是？','开车过程中不主动打电话，但是有重要电话打进来是可以边开车边接听手持电话的','根据驾龄和驾车技术，经验丰富的驾驶人可以在驾驶过程中接打手持电话','在车流量不大的道路上驾驶时，短时接听手持电话是可以的','开车需要接打电话时，应该先找到安全的地方停车再操作','D',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',0,3,1),(32,'高速公路上行车，如果因疏忽驶过出口，应怎样做','在原地倒车驶回','继续向前行驶，寻找下一个出口','立即停车','在原地掉头','B',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',2,2,0.5),(33,'驾驶机动车在高速公路遇到能见度低于200米的气象条件时，最高车速是多少？','不得超过100公里/小时','不得超过90公里/小时','不得超过80公里/小时','不得超过60公里/小时','D',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',0,8,1),(34,'驾驶机动车通过未设置交通信号灯的交叉路口时，下列说法错误的是什么？','转弯的机动车让直行的车辆、行人先行','没有交通标志、标线控制时，在进入路口前停瞭望，让右方道路的来车先行','相对方向行驶的右转弯机动车让左转弯的车辆先行','相对方向行驶的左转弯机动车让右转弯的车辆先行','D',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,4,1),(35,'准驾车型为小型汽车的，可以驾驶下列哪种车辆？','低速载货汽车','中型客车','三轮摩托车','轮式自行机械','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',1,4,0.8),(36,'驾驶机动车遇到前方低速行驶的洒水车作业时，以下做法错误的是什么？','注意避让','若洒水车有指示箭头，在确保安全的情况下按箭头指示方向变更车道','若洒水车无指示箭头，在确保安全的情况下选择合适的车道变更','通过洒水车时应急加速通过','D',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,6,1),(37,'机动车驾驶人初次申请机动车驾驶证和增加准驾车型后的多长时间为实习期？','6个月','12个月','3个月','2年','B',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',4,5,0.555556),(38,'驾驶机动车在高速公路行驶，由加速车道汇入行车道时，操纵方向盘不应该过急过猛。','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',3,0,0),(39,'变更车道前确认后方无来车时可以不开转向灯变道。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,4,1),(40,'驾驶机动车在高速公路上行驶，能见度小于50米时，只要车速不超过20公里/小时，可以不驶离高速公路。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,3,1),(41,'因交通事故造成有害气体泄漏后，进入现场抢救伤员时，抢救人员须佩戴空气呼吸器或用湿毛巾捂住口鼻。','正确','错误','','','A',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',5,0,0),(42,'驾驶机动车发生交通事故后，应注意是否有燃油泄漏、管路破裂的情况，避免意外情况出现。','正确','错误','','','A',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',1,1,0.5),(43,'在正常行车中，尽量靠近中心线或压线行驶，不给对向机动车留有侵占行驶路线的机会。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,2,1),(44,'高速公路行车发生火灾时，要将机动车驶进服务区或停车场灭火。','正确','错误','','','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,1,1),(45,'机动车转向突然失控后，若前方道路条件能够保持直线行驶，不要紧急制动。','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',3,1,0.25),(46,'驾驶机动车遇到校车在道路右侧停车上下学生，同向只有一条机动车道时，后方机动车应当停车等待。','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,2,1),(47,'机动车落水后，只有在水快浸满车厢时，才有可能开启车门或摇下车窗玻璃逃生','正确','错误','','','A',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',0,0,0),(48,'驾驶车辆通过人行横道线时，应注意礼让行人。','正确','错误','','','A',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',3,0,0),(49,'变更车道或超车不开启转向灯属于违法行为','正确','错误','','','A',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',2,1,0.333333),(50,'驾驶人在超车时，前方车辆不减速、不让道，应怎样做？','连续鸣喇叭加速超越','加速继续超越','停止继续超车','紧跟其后，伺机再超','C',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,1,1),(51,'交通事故中急救中毒伤员，以下做法错误的是什么？','尽快将中毒人员移出毒区','脱去接触有毒空气的衣服','用清水清洗暴露部位','原地等待救援','D',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',0,4,1),(52,'轮胎气压过低时，高速行驶轮胎会出现波浪变形温度升高而导致什么情况发生？','气压不稳','气压更低','行驶阻力增大','爆胎','D',0,NULL,2,'科目四','机动车总体构造和主要安全装置常识，日常检查和维护基本知识','小车','此题无详解','232321200001034835',0,1,1),(53,'轮胎气压过低时，高速行驶轮胎会出现波浪变形温度升高而导致什么情况发生？','气压不稳','气压更低','行驶阻力增大','爆胎','D',0,NULL,2,'科目四','机动车总体构造和主要安全装置常识，日常检查和维护基本知识','小车','此题无详解','232321200001034835',0,4,1),(54,'抢救骨折伤员时注意什么？','迅速抬上担架送往医院','适当调整损伤时的姿势','用绷带对骨折部位进行包扎','不要移动身体骨折部位','D',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',0,4,1),(55,'机动车在雾天临时停车时，应开启什么灯？','危险报警闪光灯、示廓灯和后位灯','左转向灯、示廓灯和后位灯','前大灯、示廓灯和后位灯','倒车灯、示廓灯和后位灯','A',0,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',1,2,0.666667),(56,'采用指压止血法为动脉出血伤员止血时，拇指压住伤口的什么位置？','近心端动脉','血管下方动脉','远心端动脉','血管中部','A',0,NULL,2,'科目四','发生交通事故后的自救、急救等基本知识，以及常见危险化学品等知识','小车','此题无详解','232321200001034835',0,1,1),(57,'雨天驾驶机动车减速慢行的主要原因是什么？','影响驾驶人视野','过快的速度会使得机动车油耗增加','制动距离会增大','紧急制动易发生侧滑','ACD',1,NULL,2,'科目四','高速公路、山区道路、桥梁、隧道、夜间、恶劣气象和复杂条件下驾驶知识','小车','此题无详解','232321200001034835',0,2,1),(59,'机动车在行驶中突遇制动失灵时，驾驶人要采取什么措施？','握稳方向','抢挂低速挡减速','使用驻车制动器减速','开启危险报警闪光灯','ABCD',1,NULL,2,'科目四','出现爆胎、转向失控、制动失灵等紧急情况时临危处置知识','小车','此题无详解','232321200001034835',0,3,1),(60,'以下什么地点不能停车？','人行横道','停车场','山区容易塌方、泥石流路段','道路施划的停车泊位内','AC',1,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','232321200001034835',0,3,1),(61,'行车中不应该有以下哪些行为？','经常观察后视镜','变更车道不开启转向灯','左臂长时间搭在车门窗上','长时间抓变速杆','BCD',1,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',0,2,1),(62,'临时停车，要注意什么？','紧靠道路右侧','开关车门不得妨碍其他车辆和行人通行','交叉路口50米以内不得停车','开左转向灯','ABC',1,NULL,2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','232321200001034835',0,2,1),(63,'如图所示，车辆在拥挤路段排队行驶时，遇有其他车辆强行穿插行驶，以下说法正确的是什么? ','迅速提高车速不让其穿插','持续鸣喇叭警告','迅速左转躲避','减速或停车让行','D',0,'/picture/1045.jpg',2,'科目四','安全行车、文明驾驶知识','小车','此题无详解','150423199910274415',0,1,1),(64,'这个标志是何含义？ ','紧急停车带','露天停车场','停车位','错车道','A',0,'/picture/picture_250.jpg',2,'科目四','交通信号及其含义','小车','此题无详解','150423199910274415',2,1,0.333333),(65,'钱某驾驶大型卧铺客车，乘载45人（核载40人），保持40公里/小时以上的车速行至八宿县境内连续下坡急转弯路段处，翻下100米深的山崖，造成17人死亡、20人受伤。钱某的主要违法行为是什么？','客车超员','驾驶时接打手持电话','疲劳驾驶','超速驾驶','AD',1,NULL,2,'科目四','道路交通安全法律、法规和规章','小车','此题无详解','150423199910274415',0,3,1),(66,'驾驶人进入驾驶室前，首先要做什么？','开启车门直接上车','注意观察天气情况','不用观察周围情况','观察机动车周围情况','D',0,NULL,2,'科目四','安全行车、文明驾驶知识','小车',NULL,'150423199910274415',0,2,1),(67,'驾驶机动车在道路上违反道路交通安全法的行为，属于什么行为？','违法行为','违章行为','违规行为','过失行为','A',0,NULL,2,'科目一','道路交通安全法律、法规和规章','小车',NULL,'150423199910274415',1,3,0.75),(68,'机动车驾驶人造成事故后逃逸构成犯罪的，吊销驾驶证且多长时间不得重新取得驾驶证？','5年内','20年内','10年内','终生','D',0,NULL,1,'科目一','道路交通安全法律、法规和规章','小车',NULL,'150423199910274415',1,2,0.666667),(69,'驾驶机动车在路口直行遇到这种信号灯应该怎样行驶？','左转弯行驶','加速直行通过','进入路口等待','不得越过停止线','D',0,'/picture/f4344fc0a87646bcb2d72758c1dbbf79.png',1,'科目一','交通信号及其含义','小车','','150423199910274415',0,3,1),(71,'123','0','1','2','3','B',0,NULL,2,'科目四','道路交通安全法律、法规和规章','小车',NULL,'150423199910274415',0,1,1);
/*!40000 ALTER TABLE `title` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user` (
  `id` char(18) NOT NULL COMMENT '身份证号',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `password` char(32) NOT NULL COMMENT '密码',
  `sex` varchar(10) DEFAULT NULL COMMENT '性别',
  `location` varchar(100) DEFAULT NULL COMMENT '居住地',
  `telephone` char(11) NOT NULL,
  `firstscore` int(11) DEFAULT NULL COMMENT '科一分数',
  `fourthscore` int(11) DEFAULT NULL COMMENT '科四分数',
  `avatar` varchar(100) DEFAULT NULL COMMENT '用户头像',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES ('150423199903150019','单群','E10ADC3949BA59ABBE56E057F20F883E',NULL,NULL,'15362925421',NULL,NULL,NULL),('150423199910274400','小白','E10ADC3949BA59ABBE56E057F20F883E',NULL,NULL,'13948633625',NULL,NULL,NULL),('150423199910274410','小风','E10ADC3949BA59ABBE56E057F20F883E',NULL,NULL,'13948633620',NULL,NULL,NULL),('150423199910274415','陈玉龙','E10ADC3949BA59ABBE56E057F20F883E',NULL,NULL,'13948633624',NULL,2,'/avatar/150423199910274415.jpg'),('150423199910274419','小雷','E10ADC3949BA59ABBE56E057F20F883E',NULL,NULL,'13948633629',NULL,NULL,NULL),('150423199911274415','小雷','C4CA4238A0B923820DCC509A6F75849B',NULL,NULL,'13948633624',NULL,NULL,NULL);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'traffic'
--

--
-- Dumping routines for database 'traffic'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-07-26 16:17:23
